tap "nikitabobko/tap" # Aerospace
tap "jorgerojas26/lazysql" 

# CLI Tools
brew "git"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "htop"
brew "lazygit"
brew "lazysql"
brew "awscli"
brew "jq"
brew "yq"
brew "gh"
brew "delta"
brew "tmux"
brew "stow"
brew "neovim"
brew "bazel" # monorepo management
cask "1password-cli"
# brew "kubectl"       # Kubernetes CLI
# brew "tailscale"     # Secure mesh VPN for homelab and remote access

# Languages n stuff
brew "python"
brew "pipx"
cask "miniconda"
brew "pyenv" # python version manager
brew "poetry" # python dependency manager
brew "uv" # python package & environment manager
# brew "node"
# brew "nvm"

# GNU Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"

# GUI Applications
# cask "iterm2"
cask "visual-studio-code"
cask "google-chome"
cask "raycast"
cask "docker-desktop" # renamed from "docker"
cask "ghostty"
cask "aerospace"
cask "caffeine"
cask "discord"
cask "chatgpt"
cask "shottr"
cask "caffeine" 
cask "1password"
# cask "zoom" - I don't want to install this by default

# My additions
cask "cursor"
# cask "windsurf"
cask "todoist-app"
cask "slack"
cask "kindavim"
cask "spotify"
cask "focusrite-control-2"
cask "twingate" # VPN

# Fonts
cask "font-jetbrains-mono-nerd-font"

